test/fixtures/files/subscription_created.json

{
  "id": "ev_169vvoU3YUvqS75n",
  "occurred_at": 1707265233,
  "source": "admin_console",
  "user": "admin@vvrkshop.art",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "169vvoU3YUvoI75i",
      "billing_period": 1,
      "billing_period_unit": "month",
      "auto_collection": "off",
      "customer_id": "16CRpYTwv1YYb63b",
      "status": "active",
      "current_term_start": 1707265233,
      "current_term_end": 1709770833,
      "next_billing_at": 1709770833,
      "created_at": 1707265233,
      "started_at": 1707265233,
      "activated_at": 1707265233,
      "created_from_ip": "24.102.97.192",
      "updated_at": 1707265233,
      "has_scheduled_changes": false,
      "channel": "web",
      "resource_version": 1707265233591,
      "deleted": false,
      "object": "subscription",
      "currency_code": "USD",
      "subscription_items": [
        {
          "item_price_id": "Netvvrk-Monthly-USD-Monthly",
          "item_type": "plan",
          "quantity": 1,
          "unit_price": 7900,
          "amount": 7900,
          "free_quantity": 0,
          "object": "subscription_item"
        }
      ],
      "due_invoices_count": 1,
      "due_since": 1707265233,
      "total_dues": 7900,
      "mrr": 0,
      "has_scheduled_advance_invoices": false
    },
    "customer": {
      "id": "16CRpYTwv1YYb63b",
      "first_name": "test",
      "last_name": "smith",
      "email": "penny@vvrkshop.art",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": false,
      "created_at": 1701185158,
      "created_from_ip": "24.102.124.194",
      "taxability": "taxable",
      "updated_at": 1703785520,
      "pii_cleared": "active",
      "channel": "web",
      "resource_version": 1703785520338,
      "deleted": false,
      "object": "customer",
      "card_status": "no_card",
      "promotional_credits": 0,
      "refundable_credits": 0,
      "excess_payments": 0,
      "unbilled_charges": 0,
      "preferred_currency_code": "USD",
      "mrr": 6583
    },
    "invoice": {
      "id": "1403",
      "customer_id": "16CRpYTwv1YYb63b",
      "subscription_id": "169vvoU3YUvoI75i",
      "recurring": true,
      "status": "payment_due",
      "price_type": "tax_exclusive",
      "date": 1707265233,
      "due_date": 1707265233,
      "net_term_days": 0,
      "exchange_rate": 1,
      "total": 7900,
      "amount_paid": 0,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 7900,
      "updated_at": 1707265233,
      "resource_version": 1707265233582,
      "deleted": false,
      "object": "invoice",
      "first_invoice": true,
      "amount_to_collect": 7900,
      "round_off_amount": 0,
      "new_sales_amount": 7900,
      "has_advance_charges": false,
      "currency_code": "USD",
      "base_currency_code": "USD",
      "generated_at": 1707265233,
      "is_gifted": false,
      "term_finalized": true,
      "channel": "web",
      "tax": 0,
      "line_items": [
        {
          "id": "li_169vvoU3YUvoi75k",
          "date_from": 1707265233,
          "date_to": 1709770833,
          "unit_amount": 7900,
          "quantity": 1,
          "amount": 7900,
          "pricing_model": "flat_fee",
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "subscription_id": "169vvoU3YUvoI75i",
          "customer_id": "16CRpYTwv1YYb63b",
          "description": "Netvvrk Monthly",
          "entity_type": "plan_item_price",
          "entity_id": "Netvvrk-Monthly-USD-Monthly",
          "tax_exempt_reason": "tax_not_configured",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        }
      ],
      "sub_total": 7900,
      "linked_payments": [],
      "applied_credits": [],
      "adjustment_credit_notes": [],
      "issued_credit_notes": [],
      "linked_orders": [],
      "dunning_attempts": [],
      "billing_address": {
        "first_name": "test",
        "validation_status": "not_validated",
        "object": "billing_address"
      }
    }
  },
  "event_type": "subscription_created",
  "webhook_status": "not_applicable",
  "webhooks": [
    {
      "id": "whv2_16BdjQTta98S3V6B",
      "webhook_status": "not_applicable",
      "object": "webhook"
    },
    {
      "id": "whv2_169lseTrjW9lv3Dj8",
      "webhook_status": "succeeded",
      "object": "webhook"
    },
    {
      "id": "whv2_AzylISTta6fjqU6v",
      "webhook_status": "not_applicable",
      "object": "webhook"
    }
  ]
}