test/fixtures/files/subscription_paused.json

{
  "id": "ev_XpbG6hnQqGGBCj3c",
  "occurred_at": 1365622909,
  "source": "api",
  "user": "full_access_key_v1",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "3Nl7oGgQqGFprj9",
      "customer_id": "3Nl7oGgQqGFprj9",
      "plan_id": "no_trial",
      "plan_quantity": 1,
      "plan_unit_price": 1000,
      "billing_period": 1,
      "billing_period_unit": "month",
      "plan_free_quantity": 0,
      "status": "paused",
      "trial_start": 1341690024,
      "trial_end": 1344368424,
      "current_term_start": 1364845254,
      "current_term_end": 1367437254,
      "created_at": 1341085225,
      "started_at": 1341690024,
      "activated_at": 1362166854,
      "updated_at": 1365622909,
      "has_scheduled_changes": false,
      "resource_version": 1365622909000,
      "deleted": false,
      "object": "subscription",
      "currency_code": "USD",
      "addons": [
        {
          "id": "data_usage",
          "quantity": 1,
          "unit_price": 95,
          "object": "addon"
        }
      ],
      "due_invoices_count": 1,
      "due_since": 1364845254,
      "total_dues": 224,
      "mrr": 0,
      "pause_date": 1365622909
    },
    "customer": {
      "id": "abcdef",
      "first_name": "Joe",
      "last_name": "Ross",
      "email": "Benjamin@test.com",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": false,
      "created_at": 1341085225,
      "taxability": "taxable",
      "updated_at": 1364845255,
      "resource_version": 1364845255000,
      "deleted": false,
      "object": "customer",
      "card_status": "valid",
      "primary_payment_source_id": "pm_3Nl7oGgQqGG6Jr42",
      "payment_method": {
        "object": "payment_method",
        "type": "card",
        "reference_id": "tok_3Nl7oGgQqGG6Jl41",
        "gateway": "chargebee",
        "gateway_account_id": "gw_3Nl7oGgQqGFlba2",
        "status": "valid"
      },
      "promotional_credits": 0,
      "refundable_credits": 0,
      "excess_payments": 0,
      "unbilled_charges": 0,
      "preferred_currency_code": "USD"
    }
  },
  "event_type": "subscription_paused",
  "webhook_status": "not_configured"
}