test/fixtures/files/subscription_reactivated.json

{
  "id": "ev_3Nl7oGgQqGFzNh3B",
  "occurred_at": 1362166855,
  "source": "admin_console",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "3Nl7oGgQqGFprj9",
      "customer_id": "3Nl7oGgQqGFprj9",
      "plan_id": "basic",
      "plan_quantity": 1,
      "plan_unit_price": 900,
      "billing_period": 1,
      "billing_period_unit": "month",
      "plan_free_quantity": 0,
      "status": "active",
      "trial_start": 1341690024,
      "trial_end": 1344368424,
      "current_term_start": 1362166854,
      "current_term_end": 1364845254,
      "next_billing_at": 1364845254,
      "created_at": 1341085225,
      "started_at": 1341690024,
      "activated_at": 1362166854,
      "updated_at": 1362166855,
      "has_scheduled_changes": false,
      "resource_version": 1362166855000,
      "deleted": false,
      "object": "subscription",
      "currency_code": "USD",
      "addons": [
        {
          "id": "data_usage",
          "quantity": 1,
          "unit_price": 95,
          "object": "addon"
        }
      ],
      "due_invoices_count": 0,
      "mrr": 995,
      "exchange_rate": 1.0,
      "base_currency_code": "USD"
    },
    "customer": {
      "id": "abcdef",
      "first_name": "Benjamin",
      "last_name": "Ross",
      "email": "Benjamin@test.com",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": false,
      "created_at": 1341085225,
      "taxability": "taxable",
      "updated_at": 1349120450,
      "resource_version": 1349120450000,
      "deleted": false,
      "object": "customer",
      "card_status": "valid",
      "primary_payment_source_id": "pm_3Nl7oGgQqGFwhb1k",
      "payment_method": {
        "object": "payment_method",
        "type": "card",
        "reference_id": "tok_3Nl7oGgQqGFwhM1j",
        "gateway": "chargebee",
        "gateway_account_id": "gw_3Nl7oGgQqGFlba2",
        "status": "valid"
      },
      "promotional_credits": 0,
      "refundable_credits": 0,
      "excess_payments": 0,
      "unbilled_charges": 0,
      "preferred_currency_code": "USD"
    },
    "invoice": {
      "id": "3",
      "customer_id": "3Nl7oGgQqGFprj9",
      "subscription_id": "3Nl7oGgQqGFprj9",
      "recurring": true,
      "status": "paid",
      "price_type": "tax_exclusive",
      "date": 1362166855,
      "due_date": 1362166855,
      "net_term_days": 0,
      "exchange_rate": 1.0,
      "total": 995,
      "amount_paid": 995,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 0,
      "paid_at": 1362166855,
      "updated_at": 1362166855,
      "resource_version": 1362166855000,
      "deleted": false,
      "object": "invoice",
      "first_invoice": false,
      "amount_to_collect": 0,
      "round_off_amount": 0,
      "has_advance_charges": false,
      "currency_code": "USD",
      "base_currency_code": "USD",
      "tax": 0,
      "line_items": [
        {
          "id": "li_3Nl7oGgQqGFzGn34",
          "date_from": 1362166854,
          "date_to": 1364845254,
          "unit_amount": 900,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "subscription_id": "3Nl7oGgQqGFprj9",
          "amount": 900,
          "description": "Basic",
          "entity_type": "plan",
          "entity_id": "basic",
          "tax_exempt_reason": "tax_not_configured",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        },
        {
          "id": "li_3Nl7oGgQqGFzHL35",
          "date_from": 1362166854,
          "date_to": 1364845254,
          "unit_amount": 95,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "subscription_id": "3Nl7oGgQqGFprj9",
          "amount": 95,
          "description": "Data Usage",
          "entity_type": "addon",
          "entity_id": "data_usage",
          "tax_exempt_reason": "tax_not_configured",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        }
      ],
      "sub_total": 995,
      "linked_payments": [
        {
          "txn_id": "txn_3Nl7oGgQqGFzJR36",
          "applied_amount": 995,
          "applied_at": 1362166855,
          "txn_status": "success",
          "txn_date": 1362166855,
          "txn_amount": 995
        }
      ],
      "applied_credits": [],
      "adjustment_credit_notes": [],
      "issued_credit_notes": [],
      "linked_orders": [],
      "billing_address": {
        "first_name": "Benjamin",
        "last_name": "Ross",
        "validation_status": "not_validated",
        "object": "billing_address"
      }
    }
  },
  "event_type": "subscription_reactivated",
  "webhook_status": "not_configured"
}